docs: update "architecture"
